# ================= BREWFILE CONFIGS ==================
# Including all configuration for homebrew
# like taps, formula, casks, settings

# Taps
tap "jandedobbeleer/oh-my-posh"
tap "oven-sh/bun"

# Formulas
brew "git"
brew "bat"
brew "eza"
brew "fastfetch"
brew "fzf"
brew "bun"
brew "node"
brew "deno"
brew "kotlin"
brew "openjdk"
brew "go"
brew "rust"
brew "python"
brew "lazygit"
brew "lazydocker"
brew "kubectl"
brew "stow"
brew "xh"
brew "zoxide"
brew "curl"
brew "oh-my-posh"
brew "nvim"
brew "helix"
brew "gh"
brew "ruby"

## Casks
cask "blip"
cask "brave-browser"
cask "ghostty"
cask "keyboardcleantool"
cask "podman-desktop"
cask "raycast"
cask "zed"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
